tutorials/compressible/rhoPimpleFoam/angledDuct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    rho
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    h { $U; }

    "(UFinal|hFinal|R|k|epsilon|omega)"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors 50;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    pMin            pMin [ 1 -1 -2 0 0 0 0 ] 1000;
}

relaxationFactors
{
    p               0.3;
    rho             0.05;
    U               0.7;
    h               0.7;
    "(k|epsilon|omega)"  0.7;
}


// ************************************************************************* //
